/*
=============================================================================================================================================================
=============================================================================================================================================================

چیست ؟ Linked List

ذخیره می‌کند هر گره شامل دو بخش اصلی است Nodes لینک لیست یک نوع ساختمان داده پویاست که به جای ذخیره داده‌ها به صورت متوالی مانند آرایه‌ها، داده‌ها را در گره‌ها

- داده Data: مقداری که در گره ذخیره می‌شود

- اشاره‌گر Pointer: آدرسی که به گره بعدی یا گره قبلی اشاره می‌کند

pointer و یک اشاره‌گر value می‌باشند، که هر گره شامل دو بخش است: داده Nodes لینک لیست‌ها یکی از انواع ساختار داده‌ای هستند که شامل مجموعه‌ای از گره‌ها 

که به گره بعدی در لیست اشاره می‌کند گره‌ها به صورت ترتیبی به هم متصل هستند و برای دسترسی به هر گره، باید از اولین گره (سر لیست) شروع کرده و از طریق گره‌ها به

ترتیب حرکت کرد در لینک لیست‌ها برخلاف آرایه‌ها که دسترسی تصادفی به عناصر دارند، دسترسی به داده‌ها به صورت ترتیبی و خطی انجام می‌شود این ساختار به خصوص

و یک  Node برای سناریوهایی که به حذف و اضافه کردن سریع گره‌ها نیاز دارند، بسیار مناسب است اجرای لینک لیست در جاوا اسکریپت شامل ایجاد یک کلاس برای گره‌ها

insert  افزودن به ابتدای لیست prepend  افزودن به انتهای لیست append  است در این کلاس‌ها، می‌توان متدهایی مانند LinkedList کلاس برای لیست پیوندی

را پیاده‌سازی کرد با استفاده از این متدها، می‌توان لیست را مدیریت و به راحتی گره‌ها را اضافه حذف printList حذف گره‌ای خاص remove افزودن به موقعیت خاص

یا اصلاح کرد

در لینک لیست‌ ها Head و Tail  =======================================================================================================================================

بسیار مهم هستند این دو اشاره‌گر، مدیریت و دسترسی به گره‌های لینک لیست را ساده‌تر می‌کنند Head و Tail در لینک لیست‌ها، دو مفهوم 

Head (سر لیست)  : اشاره‌گری که همیشه به اولین گره لینک لیست اشاره می‌کند

ویژگی‌ها  

1 ) شروع عملیات در لینک لیست (مانند پیمایش) از این گره آغاز می‌شود

2 ) است null  برابر با  Head  اگر لینک لیست خالی باشد، مقدار

3 ) به گره جدید می‌شود Head افزودن گره در ابتدای لیست باعث تغییر مقدار

4 ) به گره دوم اشاره کند Head  حذف گره از ابتدای لیست باعث می‌شود


Tail (دم لیست)  :  اشاره‌گری که همیشه به آخرین گره لینک لیست اشاره می‌کند

ویژگی‌ها:

1 ) باشد null آن برابر با  next به گره‌ای اشاره می‌کند که مقدار Tail

2 ) برای پیمایش معکوس استفاده کرد Tail در لینک لیست دوطرفه، می‌توان از

3 ) به گره جدید می‌شود Tail افزودن گره در انتهای لیست باعث تغییر مقدار

4 ) حذف گره از انتهای لیست ممکن است نیاز به پیمایش کل لیست داشته باشد در لینک لیست ساده

=============================================================================================================================================================
=============================================================================================================================================================
*/
