/*
=======================================================================================================================================================================
=======================================================================================================================================================================

Memoization یکی از تکنیک‌های بهینه‌سازی در برنامه‌نویسی است که نتایج محاسبات را ذخیره می‌کند تا از انجام محاسبات تکراری در آینده جلوگیری شود

این روش به‌ویژه برای توابع بازگشتی که داده‌ها یا ورودی‌های تکراری دارند، بسیار مفید است

=======================================================================================================================================================================

Memoization اهداف   ======================================================================================================================================================

بهبود عملکرد: کاهش تعداد محاسبات تکراری و افزایش سرعت اجرا

صرفه‌جویی در منابع: کاهش زمان پردازش و استفاده بهینه از حافظه

پرهیز از اجرای مجدد: ذخیره نتایج برای استفاده در دفعات بعدی

=======================================================================================================================================================================

Memoization Function  :  یعنی یک تابعی بسازیم که قادر باشه مقدار یا خروجی قبلی پردازش شده‌ی خودش رو به یاد داشته باشه از خوبی استفاده از  اینه که هر دفعه که تابع با آرگومان‌های

مشخص فراخونی بشه دیگه عملیات اضافی صرف  محاسبه‌ی مجدد خروجی نمیشه که اینکار باعث صرفه‌جویی  در زمان میشه اما ممکنه  مقدار  بیشتری از حافظه اشغال بشه
 
function memoize( fn) {
    const cache = {};
    return function (param) {
        if (cache[param]) {
            console.log('cached');
            return cache[param];
        } else {
            let result = fn(param);
            cache[param] = result;
            console.log(`not cached`);
            return result;
        }
    }
}
 
const toUpper = function(str) {
    return str.toUpperCase();
}
 
const toUpperMemoized = memoize(toUpper);
 
toUpperMemoized("abcdef");
toUpperMemoized("abcdef");

=======================================================================================================================================================================
=======================================================================================================================================================================
*/
