/*
=============================================================================================================================================================
سه ستون اصلی کدنویسی خوب
=============================================================================================================================================================

1 - خوانایی

2 -پیچیدگی زمانی

3 -Memory پیچیدگی 

=============================================================================================================================================================
مهارت‌هایی که مصاحبه‌کننده به دنبال آن است
=============================================================================================================================================================

مهارت‌های تحلیلی: آیا می‌توانید مشکلات را تحلیل و بررسی کنید؟

مهارت‌های کدنویسی: آیا کدی تمیز ساده سازمان‌یافته و خوانا می‌نویسید؟

دانش فنی: آیا اصول اولیه شغلی که برای آن درخواست داده‌اید را می‌دانید؟

مهارت‌های ارتباطی: آیا شخصیت شما با فرهنگ شرکت همخوانی دارد؟

=============================================================================================================================================================
مراحل گام به گام حل یک مسئله در مصاحبه
=============================================================================================================================================================

1 ) وقتی مصاحبه‌کننده سوال را مطرح می‌کند نکات کلیدی را در بالای صفحه یادداشت کنید مثل آرایه مرتب شده

مطمئن شوید که تمام جزئیات را دارید این نشان می‌دهد که سازمان‌یافته هستید

2 ) حتماً دوباره بررسی کنید : ورودی‌ها چیست؟ خروجی‌ها چیست؟

3 ) مهم‌ترین ارزش مسئله چیست؟ آیا زمان فضا یا حافظه اهمیت دارند ؟ هدف اصلی چیست؟

4 ) سوالات زیاد و غیرضروری نپرسید

5 ) با رویکرد ساده و ابتدایی  شروع کنید. اولین ایده‌ای که به ذهن می‌رسد را بیان کنید

این نشان می‌دهد که تفکر انتقادی دارید نیازی به نوشتن این کد نیست فقط در موردش صحبت کنید

6 ) یا بیشتر خوانایی پایین و غیره O(n^2) توضیح دهید چرا این روش بهترین نیست مثل پیچیدگی زمانی

7 )  از همان ابتدا کد خود را ماژولار کنید کد را به قطعات کوچک و زیبا تقسیم کنید و در صورت نیاز کامنت بگذارید

8 ) حالا کدنویسی را شروع کنید. در نظر داشته باشید که هرچه بیشتر آماده باشید و مراحل کار را بفهمید

بهتر می‌توانید کدنویسی کنید

9 ) به خطاها و نحوه شکست این کد فکر کنید فرض نکنید ورودی همیشه درست است فرض کنید کسی قصد 

خراب کردن کد شما را دارد

10 ) ورودی‌های نامعتبر را بررسی کنید مثلاً بنویسید که چه تست‌هایی می‌خواهید انجام دهید سپس توضیح دهید 

که چگونه می‌توانید کد را بهبود دهید

11 ) استفاده نکنید. کدی بنویسید که خوانا باشد i و j  از نام‌های بد و گیج‌کننده مثل

12 ) در پایان با مصاحبه‌کننده صحبت کنید که چگونه می‌توانید کد را بهبود دهید آیا کد کار می‌کند ؟ 

آیا روش‌های دیگری وجود دارد؟

13 ) آرایه‌های بزرگ، یا کدهای غیرهمگام به درستی کار می‌کند؟ null کد خود را تست کنید : آیا بدون ورودی، مقدار

14 ) از مصاحبه‌کننده بپرسید که آیا می‌توانیم فرضیاتی درباره کد داشته باشیم؟ 

=============================================================================================================================================================
چک لیست کد خوب
=============================================================================================================================================================

✅ کد کار می‌کند

✅ استفاده درست از ساختارهای داده

✅ کد قابل استفاده مجدد (عدم تکرار)

✅ ماژولار بودن: کد خواناتر، قابل نگهداری‌تر و تست‌پذیر می‌شود

✅ O(N^2) پیچیدگی زمانی کمتر از 

=============================================================================================================================================================
نکات طلایی برای موفقیت در پاسخ‌دهی
=============================================================================================================================================================

✅ هش‌مپ‌ها معمولاً بهترین راه‌حل برای بهبود پیچیدگی زمانی هستند

✅ اگر آرایه مرتب شده باشد، از درخت جستجوی دودویی استفاده کنید

✅ ورودی خود را مرتب کنید

✅ توازن بین زمان و فضا را در نظر بگیرید

✅ اگر مصاحبه‌کننده نکته‌ای می‌دهد، حتماً آن را دنبال کنید

=============================================================================================================================================================
=============================================================================================================================================================
*/
