/*
======================================================================================================================================================
======================================================================================================================================================

   به شدت لینک مهمی هست

1 -  استفاده کنید که در داخل جاوااسکریپت hashMap کنید و این کار رو زیاد انجام می‌دید، بهتره به جای آرایه از ساختمان داده find خیلی از جاهایی که روی یک آرایه میخواید یک عنصر و

باشه O(1) از مرتبه O(n) پیاده‌سازی شده این‌کار باعث میشه پیچیدگی زمانی جستجوهاتون به جای Map توسط 
 
2 - استفاده می‌شه Queue از ساختمان داده صف Throttle  , Debounce  برای پیاده‌سازی

3 - به کارتون میاد Stack احتمالا پشته  undo/redo برای پیاده‌سازی 

4 -  استفاده می‌شه hashMap از ساختمان داده cache برای پیاده‌سازی 





======================================================================================================================================================
======================================================================================================================================================
*/