/*
=====================================================================================================================================================================
=====================================================================================================================================================================

جستجوی عرضی هر دو برای پیمایش گراف‌ها استفاده می‌شوند، اما رفتارهای متفاوتی دارند BFS  جستجوی عمقی و DFS الگوریتم‌های 

=====================================================================================================================================================================

DFS (جستجوی عمقی) : روش کار: از یک گره شروع می‌کنیم و به عمق بیشتری می‌رویم تا جایی که نتوانیم ادامه دهیم، سپس به عقب برگشته و گره‌های همسایه را بررسی می‌کنیم

مناسب برای گراف‌های با عمق زیاد

نیاز به حافظه کمتری دارد

همیشه کوتاه‌ترین مسیر را پیدا نمی‌کند

مزایا: برای جستجوهای عمقی یا بررسی تمام مسیرها خوب است

معایب: ممکن است به راه‌حل‌های عمیق‌تر برخورد کند و سریع‌تر به نتیجه نرسد

=====================================================================================================================================================================

BFS (جستجوی عرضی) : روش کار: از یک گره شروع کرده و ابتدا همسایگان سطح اول را بررسی می‌کنیم، سپس به سطح‌های بعدی می‌رویم

همیشه کوتاه‌ترین مسیر را پیدا می‌کند (در گراف‌های بدون وزن)

به حافظه بیشتری نیاز دارد

مزایا: برای پیدا کردن کوتاه‌ترین مسیر و جستجوی سطحی مناسب است

معایب: مصرف حافظه بیشتر

=====================================================================================================================================================================

مقایسه:

برای پیدا کردن کوتاه‌ترین مسیر و پیمایش سطحی بهتر عمل می‌کند. DFS برای گراف‌های عمقی و جستجوی تمام مسیرها خوب است، در حالی که BFS

انتخاب بهتری است BFS ناسب‌تر است. اگر می‌خواهید کوتاه‌ترین مسیر را پیدا کنید DFS اگر حافظه کمتر می‌خواهید

=====================================================================================================================================================================
=====================================================================================================================================================================
*/